**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [4]:
import pandas as pd
import numpy as np

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [102]:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no'],'labels': ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
# dataframe birds is created from given dictionary
birds = pd.DataFrame.from_dict(data)
birds.set_index('labels')

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no


**2. Display a summary of the basic information about birds DataFrame and its data.**

In [103]:
print(birds.shape)
birds.describe()

(10, 5)

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [104]:
birds.head(2)

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
1  Cranes  4.0       4      yes      b

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [105]:
df = birds.loc[:,['birds','age']]
df

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [106]:
df = birds.loc[[2,3,7],['birds','age','visits']]
df

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [36]:
df = birds[birds['visits']<4]
df = df.set_index('labels')
df

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
c          plovers  1.5       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no



 
 **7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

Empty DataFrame
Columns: [birds, age, visits, priority, labels]
Index: []

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [108]:
df = birds[(birds['birds'] == 'Cranes')& (birds['age']<4)]
df

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
5  Cranes  3.0       4       no      f

**9. Select the rows the age is between 2 and 4(inclusive)**

In [109]:
df = birds[(birds['age']>=2) & (birds['age']<=4)]
df

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
5      Cranes  3.0       4       no      f
9  spoonbills  4.0       2       no      j

**10. Find the total number of visits of the bird Cranes**

In [110]:
df = birds[birds['birds'] == 'Cranes']
print(df['visits'].sum())

12

**11. Calculate the mean age for each different birds in dataframe.**

In [111]:
df =birds.groupby('birds').mean()
df['age']

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [118]:
#df.insert(loc,value1, value2,....)
birds.loc[11] = ['Eagle',5,3,'no','a']
print(birds)
birds.drop(11,axis =0,inplace = True)
print(birds)

         birds  age  visits priority labels
0       Cranes  3.5       2      yes      a
1       Cranes  4.0       4      yes      b
2      plovers  1.5       3       no      c
3   spoonbills  NaN       4      yes      d
4   spoonbills  6.0       3       no      e
5       Cranes  3.0       4       no      f
6      plovers  5.5       2       no      g
7       Cranes  NaN       2      yes      h
8   spoonbills  8.0       3       no      i
9   spoonbills  4.0       2       no      j
11       Eagle  5.0       3       no      a
        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5      Cranes  3.0       4       no      f
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**13. Find the number of each type of birds in dataframe (Counts)**

In [131]:
no_count = birds.groupby('priority')
no_count

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [159]:
df1 = birds.sort_values(['age','visits'],ascending = [False,True])
df1

        birds  age  visits  priority labels
8  spoonbills  8.0       3         0      i
4  spoonbills  6.0       3         0      e
6     plovers  5.5       2         0      g
9  spoonbills  4.0       2         0      j
1      Cranes  4.0       4         1      b
0      Cranes  3.5       2         1      a
5      Cranes  3.0       4         0      f
2     plovers  1.5       3         0      c
7      Cranes  NaN       2         1      h
3  spoonbills  NaN       4         1      d

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [160]:
birds.replace(to_replace = 'yes',value =1)
birds.replace(to_replace = 'no',value =0)

        birds  age  visits  priority labels
0      Cranes  3.5       2         1      a
1      Cranes  4.0       4         1      b
2     plovers  1.5       3         0      c
3  spoonbills  NaN       4         1      d
4  spoonbills  6.0       3         0      e
5      Cranes  3.0       4         0      f
6     plovers  5.5       2         0      g
7      Cranes  NaN       2         1      h
8  spoonbills  8.0       3         0      i
9  spoonbills  4.0       2         0      j









**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [154]:
birds.replace(to_replace = 'Cranes',value = 'trumpeters' )

        birds  age  visits  priority labels
0  trumpeters  3.5       2         1      a
1  trumpeters  4.0       4         1      b
2     plovers  1.5       3         0      c
3  spoonbills  NaN       4         1      d
4  spoonbills  6.0       3         0      e
5  trumpeters  3.0       4         0      f
6     plovers  5.5       2         0      g
7  trumpeters  NaN       2         1      h
8  spoonbills  8.0       3         0      i
9  spoonbills  4.0       2         0      j